[
  {
    "company": "Stotles",
    "position": "Software Engineer",
    "dates": "May 2023 - Present",
    "description": []
  },
  {
    "company": "Babylon Health",
    "position": "Software Engineer",
    "dates": "January 2022 - December 2022",
    "description": [
      "My position at Babylon Health as part of the web-platform team involved building tools and procedures for product teams to deliver features quickly to meet user needs.",
      "This required getting involved in a wide variety of work; from creating typescript packages, to designing guidelines, to building development pipelines.",
      "A large part of the work I did on building these packages was ensuring that they were not only functional and met the needs of the various teams within the organisation, but that they were also flexible and maintainable. By building in this manner, as new requirements arose or prior requirements changed, the cost for implementing these changes was low.",
      "In addition to this, I helped to design and write out guidelines for other developers to work with, ensuring a common development flow across teams when working with the platform."
    ]
  },
  {
    "company": "Made Tech",
    "position": "Software Engineer",
    "dates": "June 2018 - December 2021",
    "description": [
      "I initially joined Made Tech via their academy and in my time at the company progressed to being a Software Engineer. My work at Made Tech as a consultant for public sector clients gave me strong skills as a generalist, helping me to jump into existing codebases and hit the ground running.",
      "The projects I worked on have varied from greenfield projects such as improvements in the collation of contractual data from local councils, to migrating legacy systems to cloud platforms, to working on large scale internal CRM systems. This work was carried out in an agile way, and pairing and mobbing were common aspects of my daily workflow.",
      "Whilst being a consultant required me to pick up multiple tech stacks based upon client needs, I am particularly strong with javascript, typescript, react and express as a tech stack.",
      "The consultancy side of my role also gave me strong skills in dealing with end-users and stakeholders, allowing me to parse large amounts of information and requirements into clear goals. I was then able to communicate this effectively back to clients and deal with concerns and queries in a professional manner."
    ]
  },
  {
    "company": "Real Asset Management",
    "position": "Technical Services Consultant",
    "dates": "November 2013 - March 2018",
    "description": [
      "My main role of supporting clients over the phone and email enabled me to cultivate my ability to communicate effectively and with a professional demeanour. In addition, the unscripted support required me to be able to adapt quickly to varying queries and problems, whilst also being able to both understand a query and deliver concise and clearly understandable responses promptly. I also went on-site with clients and provided training and other supplementary services.",
      "In addition to my main support duties at the company, I also expanded my responsibilities to other areas. An example of this was regularly being involved in the QA process for the software and the accurate logging of issues for developers to be able to review.",
      "Within my first year at the company, I also gained a secondary role of looking after documentation and help files for the software suite. The process for this exposed me to both documentation writing and publishing. I completed this through the use of Adobe RoboHelp to create both chm and html files. I managed these additional responsibilities without impacting my core role of support through appropriate time management and prioritisation of tasks."
    ]
  }
]
